In [50]:
import pandas as pd

In [51]:
#excerise1

In [52]:
#Load the CSV file using read_csv.
df=pd.read_csv('dataset (1).csv')

In [53]:
#Display the first 5 rows
df.head()

   id   name   age  score   join_date    remarks
0   1   Asha  23.0   85.0  10-07-2024       good
1   2  Rahul   NaN   78.0  15-06-2024        NaN
2   3  Meera  21.0    NaN  01-08-2024  excellent
3   4  Arjun  25.0   92.0         NaN        NaN
4   5  Leela  22.0   88.0  20-05-2024       good

In [54]:
#Display the last 3 rows
df.tail(3)

   id   name   age  score   join_date            remarks
7   8   Sana  23.0    NaN  30-04-2024                NaN
8   9  Karan  29.0   71.0  14-02-2024  needs improvement
9  10  Anita  26.0   83.0         NaN               good

In [55]:
#Print the shape of the DataFrame
df.shape

(10, 6)

In [56]:
#Exercise2

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         10 non-null     int64
 1   name       9 non-null      object
 2   age        9 non-null      float64
 3   score      8 non-null      float64
 4   join_date  8 non-null      object
 5   remarks    7 non-null      object
dtypes: float64(2), int64(1), object(3)
memory usage: 612.0+ bytes

In [58]:
#Excerise3

In [59]:
#Find the number of missing values in each column.
df.isnull().sum()

id           0
name         1
age          1
score        2
join_date    2
remarks      3
dtype: int64

In [60]:
#Which column has the maximum missing values?
df.isnull().sum().idxmax()

'remarks'

In [61]:
#How many rows have at least one missing value?
df.isnull().any(axis=1).sum()

np.int64(6)

In [62]:
#Exercise4

In [63]:
#Create a new DataFrame by:dropping rows that have any missing value.
df_clean=df.dropna()

In [64]:
df_clean.shape

(4, 6)

In [65]:
#Create another DataFrame by:dropping columns that have more than 30% missing values.
threshold=len(df)*0.7
cols_to_keep=df.dropna(axis=1,thresh=threshold).columns

In [66]:
cols_to_keep

Index(['id', 'name', 'age', 'score', 'join_date', 'remarks'], dtype='object')

In [67]:
#Compare the shape before and after dropping.
df.shape

(10, 6)

In [68]:
df_clean.shape

(4, 6)

In [69]:
#Excercise5

In [84]:
#Fill missing values in age using the median.
df['age'].median()

24.0

In [85]:
df_age_filled=df.copy()

In [86]:
df_age_filled['age']=df_age_filled['age'].fillna(df_age_filled['age'].median())

In [87]:
df_age_filled['age'].isnull().sum()

np.int64(0)

In [88]:
#Fill missing values in score using the mean.
df['score'].mean()

np.float64(84.0)

In [89]:
df_score_filled=df.copy()

In [90]:
df_score_filled['score']=df_score_filled['score'].fillna(df_score_filled['score'].mean())

In [91]:
df_score_filled['score'].isnull().sum()

np.int64(0)

In [94]:
#Verify that no numeric column has missing values left.
df_score_filled.select_dtypes(include='number')
df_score_filled.select_dtypes(include='number').isnull().sum()

id       0
age      1
score    0
dtype: int64

In [95]:
df_clean = df.copy()
df_clean['age'] = df_clean['age'].fillna(df_clean['age'].median())
df_clean['score'] = df_clean['score'].fillna(df_clean['score'].mean())
df_clean.select_dtypes(include='number').isnull().sum()

id       0
age      0
score    0
dtype: int64

In [96]:
#Excerise6

In [99]:
#Replace missing name values with "UNKNOWN".
df_clean['name']=df_clean['name'].fillna("UNKNOWN")

In [101]:
df_clean['name'].isnull().sum()

np.int64(0)

In [102]:
df_clean['name'].unique()

array(['Asha', 'Rahul', 'Meera', 'Arjun', 'Leela', 'UNKNOWN', 'Vikram',
       'Sana', 'Karan', 'Anita'], dtype=object)

In [103]:
#Replace missing remarks with "Not Provided".
df_clean['remarks']=df_clean['remarks'].fillna("Not Provided")
df_clean['remarks'].isnull().sum()

np.int64(0)

In [105]:
#Check unique values in remarks.
df_clean['remarks'].unique()

array(['good', 'Not Provided', 'excellent', 'average',
       'needs improvement'], dtype=object)

In [107]:
#Excerise7

In [108]:
#Use describe() on numeric columns
df_clean.describe()

             id        age      score
count  10.00000  10.000000  10.000000
mean    5.50000  24.400000  84.000000
std     3.02765   2.412928   6.863753
min     1.00000  21.000000  71.000000
25%     3.25000  23.000000  80.750000
50%     5.50000  24.000000  84.000000
75%     7.75000  25.750000  87.250000
max    10.00000  29.000000  95.000000

In [123]:
#Run describe(include='all')
df_clean.describe(include='all')

              id  name        age      score   join_date remarks
count   10.00000     9   9.000000   8.000000           8       7
unique       NaN     9        NaN        NaN           8       4
top          NaN  Asha        NaN        NaN  10-07-2024    good
freq         NaN     1        NaN        NaN           1       3
mean     5.50000   NaN  24.444444  84.000000         NaN     NaN
std      3.02765   NaN   2.554952   7.782765         NaN     NaN
min      1.00000   NaN  21.000000  71.000000         NaN     NaN
25%      3.25000   NaN  23.000000  79.500000         NaN     NaN
50%      5.50000   NaN  24.000000  84.000000         NaN     NaN
75%      7.75000   NaN  26.000000  89.000000         NaN     NaN
max     10.00000   NaN  29.000000  95.000000         NaN     NaN